Revit 2027 API
TargetRebarEdge.TargetRebarId Property
 Identifies the id of the target Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TargetRebarId { get; }
Public ReadOnly Property TargetRebarId As ElementId
	Get
public:
property ElementId^ TargetRebarId {
	ElementId^ get ();
}
member TargetRebarId : ElementId with get
Property Value
ElementId
See Also
Reference
TargetRebarEdge Class
Autodesk.Revit.DB.Structure Namespace